Servidor/Practica10/indexACT1.xml

<?xml version="1.0" encoding="UTF-8"?>
<env:Envelope
xmlns:env="http://www.w3.org/2003/05/soap-envelope"
xmlns:ns1="https://api.open-meteo.com/v1/forecast?latitude=36.84&longitude=-2.46&current_weather=true">
<env:Header/>
<env:Body>
<ns1:getTemperatura>
<referencia> current_weather</referencia>
</ns1:getTemperatura>
</env:Body>
</env:Envelope>